---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussNotJoinedWebs
source: html/00abe21f-ebd1-edd7-e05c-4f4515b3cbb7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussNotJoinedWebs Property

The current edits are causing some webs to disjoin. The truss layout family requires additional constraints to maintain these joins.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussNotJoinedWebs { get; }
```